"""Наследствие"""
# наследование -- это новый класс, который наследует все методы, поля от родительского или суперкласса
# она все основные или базовые функции берет от родительского класса и также может добавлять к себе новые функции
# которые нужны только ему или касаются только его и при этом нам не нужно переписывать все базовые функции для каждого
# нового объекта, это удобно тем, что мало времени и мало места занимает
class Building:     # мы создаем класс Building
    def __init__(self,name, year, city):    # через конструкцию __init__ передаем базовые свойства
        self.name = name
        self.year = year
        self.city = city

    def get_info(self):     # через get_info выводим данные
        print(self.name,'построен в',self.year,'в городе',self.city)

# school = Building('Школа', 2026, 'Бишкек')
# school.get_info()
# shop = Building('Магазин', 2024,'Бишкек')
# shop.get_info()

class School(Building):
    people = 700    # кол-во учеников мб только у школы, т.е для магазина она не нужна
    def __init__(self,name,year,city,people):
        super(School,self).__init__(name,year,city)     # через super можно импортировать определнные свойства у родителя
        self.people = people    # и через self создать новое свойство people

    def get_info(self):
        super(School,self).get_info()
        print('Количество учеников:', self.people)

school = School('Школа', 2026, 'Бишкек', 700)
school.get_info()

class Shop(Building):
    pass    # через pass и предается вся информфция от суперкласса к наследственному

"""Полиморфизм"""
# когда мы выводим данные на терминал для класса School через get_info у нас мб ошибка
# тоесть выводиться только базовые свойства которые мы прописали в родительском классе и данные об учениках (people)
# который мы создали как доп свойство в отдельном классе оно не выводиться и для того чтобы вывести ее нам нужен
# полиморфизм